import pandas as pd  # Импортируем библиотеку пандас для работы с таблицами

колонки = ["ФИО", "Адрес", "Телефон", "Дата рождения"]  # Задаем список с названиями колонок
baza = pd.DataFrame(columns=колонки)  # Делаем саму таблицу

работа = 1  # Переменная для работы цикла (пока 1 — крутим меню)
while работа == 1:
    print("\n1.Показать | 2.Добавить | 3.Изменить | 4.Удалить | 5.Выход")
    vibor = input("Выбери цифру: ").strip()  # Запрашиваем номер действия

    if vibor == "1":
        print(baza if len(baza) > 0 else "Книга пустая.")  # Если в таблице есть строки, печатаем ее, иначе пишем, что пусто

    elif vibor == "2":
        # Запрашиваем данные по очереди и добавляем строку 
        имя = input("ФИО: ")
        адрес = input("Адрес: ")
        телефон = input("Телефон: ")
        др = input("Дата рождения: ")
        baza.loc[len(baza)] = [имя, адрес, телефон, др]  # добавляем строку в конец таблицы 
        print("Сохранено!")

    elif vibor in ("3", "4") and len(baza) == 0:
        print("Книга пустая.")  # Ограничение: если пусто, менять и удалять нельзя

    elif vibor == "3":
        print(baza)  # Показываем контакты перед изменением
        ввод_номера = input("Какой номер строки изменить? ").strip()
        
        if not ввод_номера.isdigit():  # Проверяем, что ввели именно число, чтобы программа не вылетала
            print("Ошибка! Нужно ввести число.")
            continue
            
        nomer = int(ввод_номера)
        if nomer in baza.index:
            # Спрашиваем новые данные. 
            f = input("Новое ФИО: ")
            if f: 
                baza.loc[nomer, "ФИО"] = f
                
            a = input("Новый Адрес: ")
            if a: 
                baza.loc[nomer, "Адрес"] = a
                
            t = input("Новый Телефон: ")
            if t: 
                baza.loc[nomer, "Телефон"] = t
                
            d = input("Новая Дата: ")
            if d: 
                baza.loc[nomer, "Дата рождения"] = d
                
            print("Изменено!")
        else:
            print("Такого номера нет.")

    elif vibor == "4":
        print(baza)  # Показываем контакты перед удалением
        ввод_номера = input("Какой номер строки удалить? ").strip()
        
        if not ввод_номера.isdigit():  # Проверяем, что ввели именно число
            print("Ошибка! Нужно ввести число.")
            continue
            
        nomer = int(ввод_номера)
        if nomer in baza.index:
            baza = baza.drop(nomer).reset_index(drop=True)  # Выкидываем строку и обновляем индексы по порядку с 0
            print("Удалено!")
        else:
            print("Такого номера нет.")

    elif vibor == "5":
        print("Пока!")
        работа = 0  # Выключаем цикл, программа закрывается


