import matplotlib.pyplot as plt  # Подключаем рисовалку графиков

# Просто пишем пальцами цифры от 1 до 5 для оси X
x = [1, 2, 3, 4, 5]  # Это наши точки на нижней линии

# Считаем вручную значения Y для первой функции: x^2 (1*1, 2*2, 3*3, 4*4, 5*5)
y1 = [1, 4, 9, 16, 25]  # Это для функции x в квадрате

# Считаем вручную значения Y для второй функции: e^x (приблизительно округлили)
y2 = [2.7, 7.4, 20.1, 54.6, 148.4]  # Это для экспоненты

# Считаем вручную значения Y для третьей функции: ln(x) (натуральный логарифм)
y3 = [0, 0.7, 1.1, 1.4, 1.6]  # Это для логарифма

# Считаем вручную значения Y для четвертой функции: x^3 (1*1*1, 2*2*2, 3*3*3...)
y4 = [1, 8, 27, 64, 125]  # Это для x в кубе

# Настраиваем окошко (названия осей взяли из лекции)
plt.title("Графики", color='#173554')  # Пишем простое название сверху
plt.xlabel('Ось X')  # Подписываем низ
plt.ylabel('Ось Y')  # Подписываем левый бок
plt.grid(True)  # Рисуем обычную сетку в клеточку

# ОГРАНИЧИВАЕМ ОСЬ Y, чтобы она не улетала до 150 и не сплющивала мелкие графики
plt.ylim(0, 30)  # Срезаем всё, что выше 30, чтобы масштаб стал нормальным!

# Рисуем первый график: x^2 (синяя линия с кружочками 'o')
plt.plot(x, y1, color='blue', marker='o', label="x^2")  # Синяя линия и круглые точки

# Рисуем второй график: e^x (зеленая линия с крестиками 'x')
plt.plot(x, y2, color='green', marker='x', label="e^x")  # Зеленая линия и крестики

# Рисуем третий график: ln(x) (красная линия с квадратиками 's')
plt.plot(x, y3, color='red', marker='s', label="ln(x)")  # Красная линия и квадраты

# Рисуем четвертый график: x^3 (черная линия с треугольниками '^')
plt.plot(x, y4, color='black', marker='^', label="x^3")  # Черная линия и треугольники

plt.legend()  # Показываем табличку с подсказками цветов
plt.show()  # Открываем картинку на экране


