import numpy as a  # Импортируем библиотеку нумпи для работы с матрицами и массивами

N = int(input('Введите количество строк: '))  # Запрашиваем у пользователя число строк
M = int(input('Введите количество столбцов: '))  # Запрашиваем у пользователя число столбцов

m = a.random.randint(1, 10, size=(N, M))  # Создаем матрицу размеров N на M из случайных чисел от 1 до 9
print(m)  # Выводим начальную матрицу в консоль

mt = a.transpose(m)  # Создаем транспонированную матрицу с помощью встроенной команды (подсмотрено в интернете)
print(mt)  # Выводим получившуюся транспонированную матрицу

if N == M:  # Если количество строк и столбцов совпадает, то матрица квадратная
    # Округляем через round, чтобы из-за микро-погрешностей Python определители сравнивались нормально
    det1 = round(a.linalg.det(m), 4)  # Считаем определитель первой матрицы
    det2 = round(a.linalg.det(mt), 4)  # Считаем определитель транспонированной матрицы
    
    if det1 > det2:  # Если первый определитель оказался больше
        print(f'Определитель начальной матрицы {det1} больше определителя транспонированной матрицы {det2}')
    if det1 < det2:  # Если первый определитель оказался меньше
        print(f'Определитель начальной матрицы {det1} меньше определителя транспонированной матрицы {det2}')
    if det1 == det2:  # Если определители получились одинаковыми
        print('Определители матриц равны')  # По правилам математики они всегда должны быть равны
else:  # Если матрица прямоугольная (N не равно M)
    print('Невозможно вычислить определители для этих матриц')  # Пишем, что определитель найти нельзя
